Ran Plan for dir: `terraform-test/gce-new` workspace: `prod`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/dev4901/Test-github-actions/28/prod/terraform-test/gce-new/prod-prod.tfplan" -var-file=$WORKSPACE.tfvars' in '/atlantis-data/repos/dev4901/Test-github-actions/28/prod/terraform-test/gce-new': exit status 1
Planning prod workflow

Success! The configuration is valid.



Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_compute_instance.web_server will be created
  + resource "google_compute_instance" "web_server" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + labels                  = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            apt-get update
            apt-get install -y nginx htop curl fail2ban ufw
            
            # Configure firewall
            ufw allow OpenSSH
            ufw allow 'Nginx Full'
            ufw --force enable
            
            # Start services
            systemctl start nginx
            systemctl enable nginx
            systemctl start fail2ban
            systemctl enable fail2ban
            
            # Create a simple page
            echo "<h1>Production Server - Terraform Managed</h1>" > /var/www/html/index.html
            echo "<p>Server: $(hostname)</p>" >> /var/www/html/index.html
            echo "<p>Deployed: $(date)</p>" >> /var/www/html/index.html
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "prod-server-atlantis-new"
      + project                 = "searce-playground-v2"
      + self_link               = (known after apply)
      + tags                    = [
          + "web-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "environment" = "prod"
          + "project"     = "searce-playground-02012024"
        }
      + zone                    = "asia-south1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-12"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 30
              + type                   = "pd-standard"
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "pilot-training-2025-vpc"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "devansh-subnet"
          + subnetwork_project          = (known after apply)
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "pilot-training-2025-sa@searce-playground-v2.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_internal_ip = (known after apply)
  + instance_name        = "prod-server-atlantis-new"
  + instance_zone        = "asia-south1-b"
╷
│ Error: Invalid index
│ 
│   on output.tf line 9, in output "instance_external_ip":
│    9:   value       = google_compute_instance.web_server.network_interface[0].access_config[0].nat_ip
│     ├────────────────
│     │ google_compute_instance.web_server.network_interface[0].access_config is empty list of object
│ 
│ The given key does not identify an element in this collection value: the
│ collection has no elements.
╵

```
</details>